#  Panda - DataFrame and Series

Pandas is a powerful data manipulation library in python, widely used for data analysis and data cleaning . it provided two primary data structure : series and DataFrame . A Series is a one-dimensional array-like object, while a DataFrame is a Two-Dimesional ,mutable and potentially hetrogeneous tabular data structure with labled axes(rows and colums)

In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\ak954\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\ak954\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ak954\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\ak954\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\ak954\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\ak954\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
import pandas as pd

In [4]:
##Series
## a pandas series is a one dimensional array likje object that can hold any data type. it is similar to a column in a table

data=[1,2,3,4,5]
series=pd.Series(data)
print("Series , \n", series)

Series ,
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
print(type(series))

<class 'pandas.core.series.Series'>

In [6]:
## create a Series from Dictionary\

data={'a':1,'b':2,'c':3}
series=pd.Series(data)
print(series)

a    1
b    2
c    3
dtype: int64

In [7]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

## DataFrame:

In [ ]:
## create a DataFrame from a Dictionary of list

data={
    'Name': ['krish','amar','ravi'],
    'Age':[25,30,45],
    'City': ['Bangalore','Patna','Florida']
}
df=pd.DataFrame(data)
print(df)
print(type)

    Name  Age       City
0  krish   25  Bangalore
1   amar   30      Patna
2   ravi   45    Florida
<class 'pandas.core.frame.DataFrame'>

In [9]:
import numpy as np
np.array(df)

array([['krish', 25, 'Bangalore'],
       ['amar', 30, 'Patna'],
       ['ravi', 45, 'Florida']], dtype=object)

In [13]:
## Create a Data Frame from a List Of Dicionary
data=[
    {'Name': 'krish', 'Age': 32 , 'City' : 'Bangalore'},
    {'Name': 'amar', 'Age': 32 , 'City' : 'Bangalore'},
    {'Name': 'jack', 'Age': 39 , 'City' : 'Bangalore'}
   
]
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  krish   32  Bangalore
1   amar   32  Bangalore
2   jack   39  Bangalore
<class 'pandas.core.frame.DataFrame'>

## Reading From .csv file

In [16]:
df=pd.read_csv('sales_data.csv')
df.head(5) # printing top 5 data

         Date     Product Region  Quantity  Unit Price
0  2025-08-25  Headphones   West         3      516.71
1  2025-08-06      Laptop   West         2     1383.06
2  2025-08-15     Monitor   West         8     1161.74
3  2025-08-05      Laptop   East         1     1277.61
4  2025-08-28      Tablet   East         8     1224.74

In [18]:
print(df.tail(4))

          Date     Product Region  Quantity  Unit Price
16  2025-08-25  Headphones   West         6     1211.27
17  2025-08-12      Tablet   East         3      215.27
18  2025-08-04    Keyboard   West         9      359.57
19  2025-08-11       Phone   East         3      379.22

In [19]:
## Accessing Data From Data Frame
df

          Date     Product Region  Quantity  Unit Price
0   2025-08-25  Headphones   West         3      516.71
1   2025-08-06      Laptop   West         2     1383.06
2   2025-08-15     Monitor   West         8     1161.74
3   2025-08-05      Laptop   East         1     1277.61
4   2025-08-28      Tablet   East         8     1224.74
5   2025-08-10      Tablet  South         5       76.17
6   2025-08-16     Monitor  South         6     1249.00
7   2025-08-23      Tablet   East         7      715.34
8   2025-08-10      Tablet   West         7      790.42
9   2025-08-28      Laptop   East         3      812.82
10  2025-08-04  Headphones  South        10      650.90
11  2025-08-21    Keyboard   West         1      601.82
12  2025-08-12  Headphones  South         7     1075.34
13  2025-08-14  Headphones   West         9      530.90
14  2025-08-04     Monitor   East         4      636.04
15  2025-08-23      Laptop  South         8      484.96
16  2025-08-25  Headphones   West         6     1211.27
17  2025-08-12      Tablet   East         3      215.27
18  2025-08-04    Keyboard   West         9      359.57
19  2025-08-11       Phone   East         3      379.22

In [20]:
data

[{'Name': 'krish', 'Age': 32, 'City': 'Bangalore'},
 {'Name': 'amar', 'Age': 32, 'City': 'Bangalore'},
 {'Name': 'jack', 'Age': 39, 'City': 'Bangalore'}]

In [21]:
df=pd.DataFrame(data)
df

    Name  Age       City
0  krish   32  Bangalore
1   amar   32  Bangalore
2   jack   39  Bangalore

In [22]:
df['Name']

0    krish
1     amar
2     jack
Name: Name, dtype: object

In [23]:
type(df['Name'])

pandas.core.series.Series

In [28]:
df.iloc[0]

Name        krish
Age            32
City    Bangalore
Name: 0, dtype: object

In [24]:
df.loc[0] ## acessing row

Name        krish
Age            32
City    Bangalore
Name: 0, dtype: object

In [25]:
df.iloc[0][0]

C:\Users\ak954\AppData\Local\Temp\ipykernel_17068\2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'krish'

In [29]:
df.iloc[0][2]
df

C:\Users\ak954\AppData\Local\Temp\ipykernel_17068\4128424618.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

    Name  Age       City
0  krish   32  Bangalore
1   amar   32  Bangalore
2   jack   39  Bangalore

In [30]:
##Accessing a Specified Eleement
df.at[2,'Age']

39

In [31]:
df.at[2,'Name']

'jack'

In [32]:
##Accessing a specified element using iat
df.iat[2,2]

'Bangalore'

## Data Manipulation With DataFrame

In [33]:
df

    Name  Age       City
0  krish   32  Bangalore
1   amar   32  Bangalore
2   jack   39  Bangalore

In [34]:
##adding new columnt
df['Salary']=[5000,50000,60000]

In [35]:
df

    Name  Age       City  Salary
0  krish   32  Bangalore    5000
1   amar   32  Bangalore   50000
2   jack   39  Bangalore   60000

In [46]:
## remove a column
df.drop('Salary') ## by defualt it will check row wise hence error

KeyError: "['Salary'] not found in axis"

In [45]:
df.drop('Salary',axis=1,inplace=True)

KeyError: "['Salary'] not found in axis"

In [44]:
df

    Name  Age       City
0  krish   32  Bangalore
1   amar   32  Bangalore
2   jack   39  Bangalore

In [48]:
## add age to the columnt

df['Age']=df['Age']+1

In [49]:
df

    Name  Age       City
0  krish   33  Bangalore
1   amar   33  Bangalore
2   jack   40  Bangalore

In [54]:
## deropping rows
df

   Name  Age       City
1  amar   33  Bangalore
2  jack   40  Bangalore

In [55]:
df.drop(1)

   Name  Age       City
2  jack   40  Bangalore

In [56]:
df

   Name  Age       City
1  amar   33  Bangalore
2  jack   40  Bangalore

In [57]:
df.drop(2)

   Name  Age       City
1  amar   33  Bangalore

In [58]:
df

   Name  Age       City
1  amar   33  Bangalore
2  jack   40  Bangalore

In [62]:
df

   Name  Age       City
2  jack   40  Bangalore

In [ ]:
df.drop(2,inplace=True) ## permanent operation

In [64]:
df

Empty DataFrame
Columns: [Name, Age, City]
Index: []

In [66]:
## Display the data types of each column
print("data types ",df.dtypes)

data types  Name    object
Age      int64
City    object
dtype: object

In [67]:
df.describe()

       Age
count  0.0
mean   NaN
std    NaN
min    NaN
25%    NaN
50%    NaN
75%    NaN
max    NaN

In [70]:
data=[
    {'Name': 'krish', 'Age': 32 , 'City' : 'Bangalore'},
    {'Name': 'amar', 'Age': 32 , 'City' : 'Bangalore'},
    {'Name': 'jack', 'Age': 39 , 'City' : 'Bangalore'}
   
]
df=pd.DataFrame(data)
df

    Name  Age       City
0  krish   32  Bangalore
1   amar   32  Bangalore
2   jack   39  Bangalore

In [69]:
df.describe()

             Age
count   3.000000
mean   34.333333
std     4.041452
min    32.000000
25%    32.000000
50%    32.000000
75%    35.500000
max    39.000000